using System.Collections.Generic;

namespace WriteNumberTask.Logic
{
    class NumberInWords
    {
        public Dictionary<int, string> vocabulary = new Dictionary<int, string>
            {
                { 0, "ноль" },
                { 1, "один" },
                { 2, "два" },
                { 3, "три" },
                { 4, "четыре" },
                { 5, "пять" },
                { 6, "шесть" },
                { 7, "семь" },
                { 8, "восемь" },
                { 9, "девять" },

                { 10, "десять" },
                { 11, "одиннадцать" },
                { 12, "двенадцать" },
                { 13, "тринадцать" },
                { 14, "четырнадцать" },
                { 15, "пятнадцать" },
                { 16, "шестнадцать" },
                { 17, "семнадцать" },
                { 18, "восемнадцать" },
                { 19, "девятнадцать" },

                { 20, "двадцать" },
                { 30, "тридцать" },
                { 40, "сорок" },
                { 50, "пятьдесят" },
                { 60, "шестьдесят" },
                { 70, "семьдесят" },
                { 80, "восемьдесят" },
                { 90, "девяносто" },

                { 100, "сто" },
                { 200, "двести" },
                { 300, "триста" },
                { 400, "четыреста" },
                { 500, "пятьсот" },
                { 600, "шестьсот" },
                { 700, "семьсот" },
                { 800, "восемьсот" },
                { 900, "девятьсот" },

                { -1000, "тысяч" },
                { 1000, "одна тысяча" },
                { 2000, "две тысячи" },
                { 3000, "три тысячи" },
                { 4000, "четыре тысячи" },
                { 5000, "пять тысяч" },
                { 6000, "шесть тысяч" },
                { 7000, "семь тысяч" },
                { 8000, "восемь тысяч" },
                { 9000,  "девять тысяч" },

                { 10000, "десять тысяч" },
                { 11000, "одиннадцать тысяч" },
                { 12000, "двенадцать тысяч" },
                { 13000, "тринадцать тысяч" },
                { 14000, "четырнадцать тысяч" },
                { 15000, "пятнадцать тысяч" },
                { 16000, "шестнадцать тысяч" },
                { 17000, "семнадцать тысяч" },
                { 18000, "восемнадцать тысяч" },
                { 19000, "девятнадцать тысяч" },

                { 20000, "двадцать" },
                { 30000, "тридцать" },
                { 40000, "сорок" },
                { 50000, "пятьдесят" },
                { 60000, "шестьдесят" },
                { 70000, "семьдесят" },
                { 80000, "восемьдесят" },
                { 90000, "девяносто" },
        };
    }
}
